# **Pandas: Data Cleaning**

In [1]:
import pandas as pd
from datasets import load_dataset
import matplotlib.pyplot as plt

In [3]:
dataset = load_dataset('lukebarousse/data_jobs')
df = dataset['train'].to_pandas()

In [4]:
df['job_posted_date'] = pd.to_datetime(df['job_posted_date'])

In [6]:
df.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0               NaN              NaN
1               NaN              NaN
2               NaN              NaN
3               NaN              NaN
4               NaN              NaN
5               NaN              NaN
6               NaN              NaN
7               NaN              NaN
8               NaN              NaN
9               NaN              NaN
10              NaN              NaN

## Filling the nonvalues with median
**Using the fillna()**

In [10]:
median_salary_year = df['salary_year_avg'].median()

In [11]:
median_salary_hour = df['salary_hour_avg'].median()

In [12]:
# Creating the new dataframe with filled values
df_filled = df

In [17]:
df_filled['salary_year_avg'] = df_filled['salary_year_avg'].fillna(median_salary_year)
df_filled['salary_hour_avg'] = df_filled['salary_hour_avg'].fillna(median_salary_hour)

In [21]:
df_filled.loc[:10, 'salary_year_avg':'salary_hour_avg']

    salary_year_avg  salary_hour_avg
0          115000.0            45.98
1          115000.0            45.98
2          115000.0            45.98
3          115000.0            45.98
4          115000.0            45.98
5          115000.0            45.98
6          115000.0            45.98
7          115000.0            45.98
8          115000.0            45.98
9          115000.0            45.98
10         115000.0            45.98

## Dropping duplicates
**Using the drop_duplicates**

In [24]:
# Create new dataframe
df_unique = df_filled
df_unique = df_unique.drop_duplicates()

Counting dropped rows

In [ ]:
print('Length of original df:        ', len(df_filled))
print('Length of drop duplicates df: ', len(df_unique))
print('Rows dropped:                 ', len(df_filled)-len(df_unique))

Length of original df:         785741
Length od drop duplicates df:  785640
Rows dropped:                  101

Dropping by column

In [ ]:
df_unique = df_unique.drop_duplicates(subset=['job_title','company_name'])

print('Length of original df:        ', len(df_filled))
print('Length of drop duplicates df: ', len(df_unique))
print('Rows dropped:                 ', len(df_filled)-len(df_unique))

Length of original df:         785741
Length od drop duplicates df:  508042
Rows dropped:                  277699